app/views/shared/_navbar.html.erb

        <li class="nav-item" style="align-center">
          <% Constituency.where(display_in_navbar: true).each do |con|  %>
---
SELECT "constituencies".* FROM "constituencies" WHERE "constituencies"."display_in_navbar" = ?  [["display_in_navbar", 1]]