app/views/home/index.html.erb

        <% if current_user.admin? %>
            There are <%= User.count %> users in the system.

---
SELECT COUNT(*) FROM "users"