app/views/candidates/index.html.erb

SELECT COUNT(*) FROM "users"
---
        <% if current_user.admin? %>
            There are <%= User.count %> users in the system.
<p>

SELECT "constituencies".* FROM "constituencies"
---
All Constituencies <br>
<% Constituency.all.each do |con|  %>

SELECT "constituencies".* FROM "constituencies"
---
All Constituencies <br>
<% Constituency.all.each do |con|  %>