app/controllers/candidates_controller.rb

SELECT "constituencies".* FROM "constituencies" WHERE "constituencies"."name" = ? LIMIT ?  [["name", "Punjab"], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" WHERE "candidates"."constituency_id" = ?  [["constituency_id", 1]]
SELECT "candidates".* FROM "candidates"
---
  def index
    if params.has_key?(:constituency)
      @constituency = Constituency.find_by_name(params[:constituency])
      @candidates = Candidate.where(constituency: @constituency)
    else
    @candidates = Candidate.all

INSERT INTO "candidates" ("partyname", "constituency_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["partyname", "Jamat-e-islami"], ["constituency_id", 4], ["created_at", "2022-11-02 10:03:25.561572"], ["updated_at", "2022-11-02 10:03:25.561572"]]
---
  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_candidate
      @candidate = Candidate.find(params[:id])