app/controllers/constituencies_controller.rb

SELECT "constituencies".* FROM "constituencies"
---
  def index
    @constituencies = Constituency.all

INSERT INTO "constituencies" ("name", "display_in_navbar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Punjab"], ["display_in_navbar", 1], ["created_at", "2022-11-02 08:19:50.475366"], ["updated_at", "2022-11-02 08:19:50.475366"]]
---
  def create
    @constituency = Constituency.new(constituency_params)

    respond_to do |format|
      if @constituency.save

UPDATE "constituencies" SET "display_in_navbar" = ?, "updated_at" = ? WHERE "constituencies"."id" = ?  [["display_in_navbar", 0], ["updated_at", "2022-11-02 08:20:07.131817"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @constituency.update(constituency_params)

DELETE FROM "constituencies" WHERE "constituencies"."id" = ?  [["id", 5]]
---
  def destroy
    @constituency.destroy

SELECT "constituencies".* FROM "constituencies" WHERE "constituencies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_constituency
      @constituency = Constituency.find(params[:id])